import * as A from './About.style';

export default function Developer() {
  const students = [
    '이민영',
    '윤서영',
    '최혜림',
    '이유종',
    '정혜연',
    '신하늘',
    '박지현',
    '박효원',
    '정지영',
    '박현지',
    '박은진',
    '김현진',
    '정해인',
    '백소민',
    '최연',
    '박효영',
    '홍수연',
    '김은서',
    '신정윤',
    '김혜수',
    '오윤지',
    '한진경',
    '양희정',
    '박윤서',
    '김수연',
    '선가연',
    '정현조',
    '유수연',
    '박현수',
    '권희원',
    '남서현',
    '유예원',
    '이우현',
    '왕예진',
    '김민희',
    '양지선',
    '고윤아',
    '김나령',
    '박세연',
    '유수현',
    '권서희',
    '황성민',
    '신민서',
    '강수민',
    '조남윤',
    '류영주',
    '정은채',
    '이세이',
    '김지연',
    '정다교',
    '윤정원',
    '장지은',
    '조유진',
    '이서현',
    '이수아',
    '이규민',
    '박서진',
    '김지민',
    '김정은',
    '조은서',
    '노하림',
    '홍가영',
    '양유진',
    '고현정',
  ];

  return (
    <A.DevWrapper>
      {students.map((data) => (
        <A.StudentWrap>
          <A.Dot />
          <A.Student>{data}</A.Student>
        </A.StudentWrap>
      ))}
    </A.DevWrapper>
  );
}
